app/views/event/show.html.erb

  <h4>Tasks:</h4>
  <% @event.tasks.each do |task| %>
    <p><%= link_to task.title, event_task_path(@event, task) %> - <%= task.workers_required - task.users.all.count %> position(s) remaining</p>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "user_tasks" ON "users"."id" = "user_tasks"."user_id" WHERE "user_tasks"."task_id" = ?  [["task_id", 2]]