app/controllers/event_controller.rb

  def create
    @event = current_user.events.build(event_params)
    @event.save
---
INSERT INTO "events" ("title", "description", "date", "start_time", "end_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    set_event
    @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]