app/controllers/task_controller.rb

INSERT INTO "tasks" ("title", "description", "start_time", "end_time", "workers_required", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    set_event
    @task = @event.tasks.build(task_params)
    if !@task.save

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]
---
  def destroy
    set_event
    task.destroy